{
  "results": [
    {
      "address": {
        "sa1": "11101120615",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "67 Old Belmont Road"
      },
      "area_level": "address",
      "area_name": "67 Old Belmont Road, Belmont North, NSW",
      "attributes": {
        "bathrooms": 1,
        "bedrooms": 3,
        "building_size": "None",
        "description": "Full of character and warmth, this classic weatherboard cottage is the perfect opportunity for first home buyers or investors. \nSet in a sought-after Belmont North location, it offers generous living spaces, plenty of potential, and a lifestyle of comfort and convenience.\nKey Features:\n Three well-sized bedrooms, all with built in wardrobes\n Modern kitchen with excellent storage and functionality\n Spacious dining area\n Comfortable living area\n Large rear sunroom\n Neat bathroom with separate WC for convenience\n Large laundry with bonus storage room \n Reverse cycle air conditioning\n Double car garage with extra off-street parking\n Situated on a 556.4m block with reserve directly behind\n \nLocation & Lifestyle:\n 0.5km to Belmont North Public School\n 1.5km to Marks Oval\n 2.0km to Jewells Plaza\n 3.1km to Belmont's central shopping precinct\n",
        "garage_spaces": 2,
        "land_size": "556 m²"
      },
      "coordinates": {
        "latitude": -33.01649474,
        "longitude": 151.67157968
      },
      "gnaf_pid": "GANSW704073819",
      "listing_date": "2025-10-08",
      "price": 890000,
      "property_type": "House"
    },
    {
      "address": {
        "sa1": "11101120624",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "17 Dulungra Avenue"
      },
      "area_level": "address",
      "area_name": "17 Dulungra Avenue, Belmont North, NSW",
      "attributes": {
        "bathrooms": 3,
        "bedrooms": 5,
        "building_size": "None",
        "description": "Expressions of Interest closes Tuesday 28th October\nThis beautifully presented five-bedroom, three-bathroom home combines generous proportions, modern finishes, and a flexible design, creating the perfect haven for growing families. With multiple living zones, a well-planned floor layout, and both indoor and outdoor spaces for relaxation and entertaining, it offers the ideal balance of lifestyle and convenience.\nAt the heart of the home is the contemporary kitchen, complete with stone benchtops, sleek appliances, a walk-in pantry, and abundant preparation space. Overlooking the open-plan dining and living areas, it creates a natural hub for family gatherings. The adjoining undercover entertaining area and fully fenced backyard can be viewed directly from the kitchen-perfect for hosting friends or keeping an eye on children at play.\nThe five bedrooms are all generously sized, including a luxurious master suite with two walk-in wardrobes and a private ensuite. Two additional bathrooms service the home, ensuring family practicality. Multiple living zones offer flexibility for relaxation, work, or play, while an elevated front balcony captures a leafy outlook, providing yet another retreat.\nEveryday comfort is assured with air conditioning, ceiling fans, and thoughtful design throughout, while ample storage is cleverly integrated across the home. A secure double garage with internal access and a large under-house storage area provide plenty of room for vehicles and equipment, with the bonus of an extra parking space at the top of the driveway. Energy efficiency and peace of mind are built in, thanks to solar panels, a security alarm system, water tank, and block-out window awnings.\nPerfectly located, you'll be approx. 500m to Floraville Public School and 3.3km to Belmont High School, with Jewells Plaza just 2.2km away and major retail options at Bennetts Green Homemakers Centre (approx. 3.5km) and Belmont Central (approx. 4.3km). Weekends are made for lifestyle, with Belmont Baths only approx. 4km away, Redhead Beach approx. 6.2km, and Warners Bay Foreshore approx. 7km.\nA true family sanctuary offering space, style, and a prime location-this is a home that will adapt with your family and deliver the lifestyle you've been searching for.\nThe information contained herein has been provided by people we believe to be reliable, however all interested parties must rely on their own enquiries.",
        "garage_spaces": 2,
        "land_size": "605 m²"
      },
      "coordinates": {
        "latitude": -33.01204354,
        "longitude": 151.66851581
      },
      "gnaf_pid": "GANSW715835616",
      "listing_date": "2025-10-08",
      "price": 1350000,
      "property_type": "House"
    },
    {
      "address": {
        "sa1": "11101120604",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "5 Pinnaroo Close"
      },
      "area_level": "address",
      "area_name": "5 Pinnaroo Close, Belmont North, NSW",
      "attributes": {
        "bathrooms": 3,
        "bedrooms": 4,
        "building_size": "nan",
        "description": "This large family home offers many applications - positioned on the high side of the road enables you to take advantage of the sea breezes and lovely view to Lake Macquarie.\n\n\nFreshly painted the home is ready for you to move in and enjoy. Light-filled interiors are complemented by multiple indoor and outdoor living areas, perfect for family life and entertaining. Thoughtfully designed for family living, the homes layout flows effortlessly across levels and provides the new owner with opportunities to accommodate generations.\n\nIncluded in this lovely home:\n\tFormal entry and living space with stunning Cathedral Ceiling -\nflowing into an open plan living room and dining room all leading out to front deck with views to the lake\n\tKitchen with Caesarstone benchtops, double sink, Miele dishwasher and Electrolux oven and microwave\n\tFormal lounge\n\tMain bedroom has walk in robe, renovated ensuite and fan\n\tBedrooms 2 and 3 have built in robes and fans\n\tWalk in linen press\n\tMain bathroom features a corner spa and large shower\n\tAlfresco area and grassed back yard\n\nDownstairs\n\t4th bedroom with built in robes\n\tFamily room with split system air conditioning and a 3rd bathroom\n\tOversized double garage with storage room\n\t9m x 5m carport\n\tSolar electricity\n\nPositioned for both convenience and lifestyle, this home is just moments from local schools, shopping, the lake, and some of the regions best beaches and walking trails.  1.2 km to Jewells Primary School  2.1 km to Belmont Christian College  3.5 km to Belmont High School  Close to Jewells Shopping Centre, Redhead Beach, Lake Macquarie, the Fernleigh Track and major link roads to Newcastle and Sydney.\n\n\nDont miss your chance to secure a family home in a tightly held enclave with captivating views and room to grow.\n\nDisclaimer: We have obtained all information provided here from sources we believe to be reliable; however, we cannot guarantee its accuracy. Prospective purchasers are advised to carry out their own investigations and satisfy themselves of all aspects of such information including and without limitation, any income, rentals, dimensions, areas, zoning, inclusions and exclusions.",
        "garage_spaces": 3,
        "land_size": "768.0"
      },
      "coordinates": {
        "latitude": -33.02006063,
        "longitude": 151.6800542
      },
      "gnaf_pid": "GANSW704079805",
      "listing_date": "2025-10-13",
      "price": 1200000,
      "property_type": "House"
    },
    {
      "address": {
        "sa1": "11101120634",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "Unit 13, 348 Pacific Highway"
      },
      "area_level": "address",
      "area_name": "Unit 13, 348 Pacific Highway, Belmont North, NSW",
      "attributes": {
        "bathrooms": 1,
        "bedrooms": 3,
        "building_size": "None",
        "description": "Effortlessly stylish and designed for easy living, this refreshed three-bedroom townhouse offers a smart, low-maintenance lifestyle in a superb setting. Step inside to discover a spacious open plan living & dining area flowing out to a generous sized courtyard. The kitchen features stone benchtops and S/S appliances along with an abundance of cupboard space. \nUpstairs, three generously sized bedrooms feature built-in robes with one boasting a walk in. A well-appointed main bathroom services each bedroom, ensuring comfort and convenience for the whole household.\nPositioned between Jewells and Belmont, you'll have everyday essentials within easy reach while living close to the natural beauty of Lake Macquarie and Redhead Beach. If you're into the outdoors, you'll love weekends exploring 4WD tracks at Belmont Wetlands or cycling the Fernleigh Track all the way to Swansea or Adamstown.\n- Completely repainted with new carpets throughout \n- Only one adjoining neighbour in a quiet complex\n- Wrap around courtyard\n- Single lock-up garage with internal access & courtyard access, perfect for two wheelers\n- Large laundry and a second toilet\n- Ducted air conditioning throughout",
        "garage_spaces": 1,
        "land_size": "None"
      },
      "coordinates": {
        "latitude": -33.02111096,
        "longitude": 151.66619672
      },
      "gnaf_pid": "GANSW717131278",
      "listing_date": "2025-10-22",
      "price": 650000,
      "property_type": "Unit"
    },
    {
      "address": {
        "sa1": "11101120610",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "30 John Fisher Road"
      },
      "area_level": "address",
      "area_name": "30 John Fisher Road, Belmont North, NSW",
      "attributes": {
        "bathrooms": 1,
        "bedrooms": 3,
        "building_size": "nan",
        "description": "Welcome to 30 John Fisher Drive, Belmont North - a beautifully presented family home combining comfort, character, and convenience. Set on a 556.4m block in a quiet, well-regarded street with a leafy outlook, this residence offers a warm and inviting atmosphere with ample space for the whole family.\n\nKey Features:\n Three generous bedrooms, all with built-in robes\n Main bathroom plus 2nd WC off the spacious laundry\n Two large living areas, perfect for family relaxation and entertaining\n Stunning high ceilings with exposed beams in the rear living area\n Abundance of natural light throughout the home\n Ceiling fan in the main bedroom\n Split-system air conditioner in the second living space\n Spacious kitchen with ample storage and bench space\n Tandem double garage with lots of under-house storage\n Additional shed at the rear providing extra storage options\n Well-sized, low-maintenance yard ideal for families or hobby gardeners\n\nLocation & Lifestyle:\n\tDirectly opposite a peaceful, scenic outlook\n\t0.5km to Belmont Christian College\n\t2.5km to Belmont Central Shopping Centre\n\t2.5km to Belmont High School\n\t4.5km to Redhead Beach\n\tEasy access to local parks, transport, and recreational facilities\n",
        "garage_spaces": 3,
        "land_size": "556.4"
      },
      "coordinates": {
        "latitude": -33.02311367,
        "longitude": 151.66921469
      },
      "gnaf_pid": "GANSW704076321",
      "listing_date": "2025-10-20",
      "price": 900000,
      "property_type": "House"
    },
    {
      "address": {
        "sa1": "11101120609",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "Unit 2, 1 Vincent Street"
      },
      "area_level": "address",
      "area_name": "Unit 2, 1 Vincent Street, Belmont North, NSW",
      "attributes": {
        "bathrooms": 1,
        "bedrooms": 2,
        "building_size": "None",
        "description": "Discover the epitome of comfortable retirement living in this completely renovated two-bedroom unit at the prestigious Calvary Nazareth Retirement Village. Unit 2 stands apart with its comprehensive full refurbishment, featuring a stunning brand new kitchen and luxurious brand new bathroom - ready for you to simply move in and enjoy.\nWhat sets Unit 2 apart:\nComplete full refurbishment throughout\nBrand new modern kitchen with quality fittings\nPristine new bathroom with contemporary finishes\nPremium presentation ready for immediate occupancy\nKey Features:\n2 generous bedrooms\nSpacious living area perfect for entertaining\nSingle carport for secure parking\nVisitor parking available for guests\nWelcoming community atmosphere\nPrime Location Benefits:\nJust 8 minutes to Bennetts Green Homemaker Centre\nOnly 6 minutes to Belmont Shopping Village\nEstablished retirement village with excellent amenities\nThis immaculately presented unit offers the perfect blend of modern comfort and village lifestyle. With everything brand new and move-in ready, Unit 2 represents exceptional value for discerning buyers seeking quality without compromise.\nYou may have to pay a departure fee to exit this village.",
        "garage_spaces": 1,
        "land_size": "None"
      },
      "coordinates": {
        "latitude": -33.02289234,
        "longitude": 151.66747673
      },
      "gnaf_pid": "GANSW718650493",
      "listing_date": "2025-04-29",
      "price": 599000,
      "property_type": "Unit"
    },
    {
      "address": {
        "sa1": "11101120634",
        "sal": "Belmont North",
        "state": "NSW",
        "street": "380-384 Pacific Highway"
      },
      "area_level": "address",
      "area_name": "380-384 Pacific Highway, Belmont North, NSW",
      "attributes": {
        "bathrooms": null,
        "bedrooms": null,
        "building_size": "1377.0",
        "description": "A rare strategic offering providing a prominent sought after northbound corner site location poised to capitalise on burgeoning local development.\n\n 1,377m* Site area\n\n Zone MU1: Mixed use\n\n Substantial 47.5m* Pacific Highway frontage\n\n Fenced hardstand yard\n\n Site office\n\n\nFor Sale: Expressions of Interest campaign closing 4PM Monday 27 October 2025.\nAll offers must be received by the Agent in writing by the deadline to be considered. \n\n\n\n\n*Approximately",
        "garage_spaces": null,
        "land_size": "1377.0"
      },
      "coordinates": {
        "latitude": -33.02305765,
        "longitude": 151.66381854
      },
      "gnaf_pid": "GANSW716483968",
      "listing_date": "2025-09-23",
      "price": 1800000,
      "property_type": "Unit"
    }
  ]
}